{
  "Anastasia Olga (Olnancy) Tzirides": {
    "image": "Anastasia Olga Tzirides.jpg",
    "description": "Anastasia-Olga (Olnancy) Tzirides is a PhD candidate in the Learning Design and Leadership Program at University of Illinois, Urbana-Champaign. Her research interests include emerging digital technologies, online education, as well as language and culture learning. Her current project focuses on exploring the potential of using digital technologies and Artificial Intelligence combined with a multimodal and translanguaging approach to language learning."
  },
  "Che Kun Law": {
    "image": "Che Kun Law.jpg",
    "description": "Che Kun Law is currently a Roboticist at Vicarious AI, where he works on Artificial General Intelligence (AGI) for robots. He has diverse robotics experience in self-driving trucks, robots in agriculture, surveillance/military, logistics/warehouse, service, social robots, drones; and his passion is in using robotics and automation to create meaningful impact at scale. Che Kun has received five Product Design/Robotics awards such as the Singapore Good Design Mark (SG Mark) Award. He graduated from Purdue University with a Masters in Mechanical Engineering, where he worked on mobile robotics for precision agriculture."
  },
  "Chieh-Li \"Julian\" Chin": {
    "image": "Chieh-Li Chin.jpg",
    "description": "Chieh-Li \"Julian\" Chin is a data analyst at the Data and Technology Innovation Lab at Technology Services at the University of Illinois at Urbana-Champaign, and a research manager at the Social Computing Lab led by Professor Jana Diesner in the School of Information Sciences (iSchool). She has a B.S. in Business Administration, an M.S. in Library and Information Sciences, and an M.S. in Computer Science. She is experienced in software development, web development, and data analysis. Her research interests focus on data ethics and regulations in research practices in the area of responsible computing."
  },
  "Craig Zilles": {
    "image": "Craig Zilles.jpg",
    "description": "Associate Professor in Computer Science at the University of Illinois at Urbana-Champaign.  I've won teaching awards at the College, campus, and international level.  I co-founded the Computer-based Testing Facility and regularly publish in venues at the intersection of computing/technology and education."
  },
  "Geoffrey Challen": {
    "image": "Geoffrey Challen.jpg",
    "description": "I'm an educator who also loves to hack. I create content and tools that have helped thousands of students learn computer science and programming."
  },
  "Haitham El Mengad": {
    "image": "Haitham Mengad.jpeg",
    "description": "I'm a PM and software engineer with experience in consumer products, enterprise software, venture capital, open source and academic research. Also a UIUC engineering alum!"
  },
  "Heather Huynh": {
    "image": "Heather Huynh.png",
    "description": "Heather is a graduated Masters student from the University of Illinois at Urbana-Champaign. She has previously interned at Google, Blend, and Los Alamos National Labs and focused her research on visualizing diversity in fashion. She also worked as a TA for many beginner level CS courses at UIUC. She hopes to use her skills to create impactful technology for others."
  },
  "Jennie Magiera": {
    "image": "Jennie Magiera.jpg",
    "description": "Jennie Magiera is Google’s Global Head of Education Impact, bestselling author of Courageous Edventures, and founder of the education equity nonprofit Our Voice Alliance. A lifelong educator, Jennie taught for over a decade and has also been an instructional coach, building leader, and district administrator. She served on the TWG for the US Dept of Education’s National EdTech Plan, and has been featured on programs such as NBC’s Education Nation, C-SPAN’s Reimagining Education, TEDx, and NPR."
  },
  "Kyle Begovich": {
    "image": "Kyle Begovich.png",
    "description": "I'm a recent graduate from the Math & CS program now working as a Software Engineer in privacy at Google. I've been engaged with many of the UIUC student events, other hackathons, and non-profit work in my spare time as a student. I am always looking to improve and give back to the technical education ecosystem and promote the welfare of our communities, so please feel free to reach out!"
  },
  "Margarita Zias": {
    "image": "Margarita Zias.jpg",
    "description": "Margarita works as a full-time Information Security Associate and is currently based in Illinois. Although she has lived there for almost a year she says nothing can beat NYC pizza. Before moving, Margarita attended CUNY Queens College where she studied Computer Science. Her passion for cyber grew during her time working as project manager at the Queens College Tech Incubator. She describes herself as a complete geek and loves legos, superheroes, manga and anime. \n\nFun fact, she actually grew up in a small town in Greece called Kastoria and came back to US for college!"
  },
  "Matthew Turk": {
    "image": "Matthew Turk.jpg",
    "description": "I'm an assistant professor at the School of Information Sciences, where I teach data visualization and data storytelling, and I build open source, community-driven tools for data analysis and visualization.  My background is in the physical sciences (astronomy) where I study how the first stars in the universe formed."
  },
  "Nerla Jean-Louis": {
    "image": "Nerla Jean.jpg",
    "description": "I am currently working as an intern at IBM Research for the summer. I am also a phd student at University of Illinois at Urbana Champaign"
  },
  "Page Wolf": {
    "image": "Page Wolf.jpg",
    "description": "Dr. Page Wolf is a professor and Faculty Development Chair in the Teaching, Learning and Educational Technology Center at the College of Lake County.  She has been at CLC since 1999 and prior worked at the Center for the Application of Information Technologies at Western Illinois University, helping develop WIU's first online courses.  Her educational background includes B.S. Communication (UIUC), M.S.Ed Instructional Technology (NIU), and Ph.D. in Higher Education Administration (Illinois State).  Her role includes working with faculty to help effectively utilize technology as an instructional tool, from educational apps to online and blended learning."
  },
  "Rohan Pandit": {
    "image": "Rohan Pandit.jpg",
    "description": "Hi! I'm Rohan. I just graduated from Columbia with a degree in Applied Mathematics and am now working in the Blockchain/Finance."
  },
  "Sam Fineberg": {
    "image": "Sam Fineberg.jpg",
    "description": "Dr. Fineberg is a principal architect at Akamai Technologies.  Sam has over 25 years of experience in areas including hyperscale storage, data analysis,  non-volatile memory, high performance computing, and data preservation.  At Akamai, he oversees the processing of multiple PB per day of internet logs from Akamai’s global network."
  },
  "Silas Hsu": {
    "image": "Silas Hsu.jpg",
    "description": "Hi! I'm a CS PhD student at UIUC in the area of Human-Computer Interaction. I am most experienced in web-development, and I'm passionate about music technology and making software that's stable and joyful to use."
  },
  "Sneha Krishna Kumaran": {
    "image": "Sneha Krishna Kumaran.jpg",
    "description": "I am a 6th year PhD student in Computer Science focusing on building educational technology for self-driven learners working with Prof. Brian Bailey. I received the State Farm Doctoral Fellowship in 2019. Prior to starting my graduate career, I completed my BS in Computer Science from Oregon State University, with an undergraduate thesis mentored by Prof. Rebecca Hutchinson and Prof. Thomas Dietterich."
  },
  "Stuart L Mattingly": {
    "image": "Stuart Mattingly.jpg",
    "description": "I am a doctoral candidate, research and teaching assistant in the EPOL LDL program. I have been teaching in some capacity for almost 20 years including high school and college. Most recently, I worked as an online business and media arts instructor. Originally, I am from Louisville, Kentucky but currently live in Tucson, Arizona with my awesome wife and son. My research interests center around effective online pedagogy, curriculum design, authentic assessment, and communities of practice."
  },
  "Susi Burke": {
    "image": "Susi Burke.jpg",
    "description": "After 30+ years in the tech industry, name a tech job and Susi has probably done it - from Software Engineer to Chief Product Officer, using skills ranging from development and analysis to database design, UI/UX, project and product mgmt. Currently she is advising several social good startups Phin, Kikori and CVKE) and nonprofits (MediaPowerYouth). She is the Chief Impact officer at Phin where she is tasked with advocating for Phin's social causes and helping that community create the maximum impact.  She is also the Tech Advisor at Kikori which is an Experiential Education and Social Emotional Learning app."
  },
  "Tamara Nelson-Fromm": {
    "image": "Tamara Nelson-Fromm.png",
    "description": "Tamara is a PhD student studying the intersection of education and computing, with a focus on integrating CS lessons with non-STEM subjects in high school settings. Over the last 3 years she has been the director of a tech-themed summer camp, a data structures course assistant, and a coding camp instructor. Tamara graduated from UIUC with a BS in CS in May 2020."
  }
}